---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesSketchesWithProfileUnfriendlyCurves
source: html/c18ed607-eb75-9dff-e778-8a6c12cba565.htm
---
# Autodesk.Revit.DB.BuiltInFailures.DPartFailures.DivideVolumesSketchesWithProfileUnfriendlyCurves Property

Sketch contains curves to which profiles cannot be applied or chains of curves.

## Syntax (C#)
```csharp
public static FailureDefinitionId DivideVolumesSketchesWithProfileUnfriendlyCurves { get; }
```